src/Documents/ИС_Ozon_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tpl_provider</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivering_date</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lower_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>upper_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_multibox</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>multi_box_qty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address_tail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer_email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_method_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tracking_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_express</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказФБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_gtd</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_country</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_mandatory_mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_rnpt</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_Ozon_Заказ/Forms/ФормаНастройкиЛистаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;	
	МассивЗначений.Добавить("ПечататьАртикул1С");   
	МассивЗначений.Добавить("ПечататьАртикулОзон");
	МассивЗначений.Добавить("ПечататьКоличество");   
	МассивЗначений.Добавить("ПечататьНазвание");
	МассивЗначений.Добавить("ПечататьНомерРеализации"); 
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 
	МассивЗначений.Добавить("ПечататьНомерСтроки");   	
	МассивЗначений.Добавить("ПечататьНомерСборочного");	
	МассивЗначений.Добавить("ПечататьРазмер");	
	МассивЗначений.Добавить("ПечататьШтрихкод");	
	МассивЗначений.Добавить("ПечататьФото");	
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль,Перечисления.ИС_МП_Маркетплейсы.Озон,МассивЗначений);
		
	Если Результат.Количество() = 0 Тогда		
		ПечататьАртикулОзон 		= Истина;				
		ПечататьНазвание 			= Истина;
		ПечататьНомерСборочного 	= Истина;
		ПечататьРазмер 				= Истина;		
		ПечататьШтрихкод		 	= Истина;
		ПечататьФото			 	= Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере(Профиль);
	Закрыть();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаСервере 
Процедура СохранитьДанныеНаСервере(Профиль)
	
	СтруктураРезультатовЗначение = Новый Структура;	
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикул1С", ПечататьАртикул1С);
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикулОзон", ПечататьАртикулОзон);		
	СтруктураРезультатовЗначение.Вставить("ПечататьКоличество", ПечататьКоличество);
	СтруктураРезультатовЗначение.Вставить("ПечататьНазвание", ПечататьНазвание); 
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерРеализации", ПечататьНомерРеализации);	
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерЗаказа", ПечататьНомерЗаказа);
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСтроки", ПечататьНомерСтроки); 
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСборочного", ПечататьНомерСборочного);
	СтруктураРезультатовЗначение.Вставить("ПечататьРазмер", ПечататьРазмер);	
	СтруктураРезультатовЗначение.Вставить("ПечататьШтрихкод", ПечататьШтрихкод);
	СтруктураРезультатовЗначение.Вставить("ПечататьФото", ПечататьФото);

	ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, СтруктураРезультатовЗначение);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти
